export const questions2 = [
  {
    name: ' 1，感到头疼',
    type: 1,
    id: 1,
  },
  {
    name: ' 2，感到神经过敏，心中不踏实',
    type: 5,
    id: 2,
  },
  {
    name: ' 3，头脑中不必要的想法或者字句盘旋',
    type: 2,
    id: 3,
  },
  {
    name: ' 4，出现头昏或者晕倒',
    type: 10,
    id: 4,
  },
];



export const questions = [
  {
    name: ' 1，感到头疼',
    type: 1,
    id: 1,
  },
  {
    name: ' 2，感到神经过敏，心中不踏实',
    type: 5,
    id: 2,
  },
  {
    name: ' 3，头脑中不必要的想法或者字句盘旋',
    type: 2,
    id: 3,
  },
  {
    name: ' 4，出现头昏或者晕倒',
    type: 1,
    id: 4,
  },
  {
    name: ' 5，对异性的兴趣减退',
    type: 4,
    id: 5,
  },
  {
    name: ' 6，对旁人的责备求全',
    type: 3,
    id: 6,
  },
  {
    name: ' 7，感觉别人能控制自己的思想',
    type: 9,
    id: 7,
  },
  {
    name: ' 8，会责怪别人制造麻烦',
    type: 8,
    id: 8,
  },
  {
    name: ' 9，感到记忆性不好',
    type: 2,
    id: 9,
  },
  {
    name: ' 10，担心自己的衣饰整齐及仪态端庄',
    type: 2,
    id: 10,
  },
  {
    name: ' 11，容易烦恼和激动',
    type: 6,
    id: 11,
  },
  {
    name: ' 12，感到胸口痛',
    type: 1,
    id: 12,
  },
  {
    name: ' 13，害怕空旷的场所和街道',
    type: 7,
    id: 13,
  },
  {
    name: ' 14，感到自己精力下降，活动减少',
    type: 4,
    id: 14,
  },
  {
    name: ' 15，想结束自己的生命',
    type: 4,
    id: 15,
  },
  {
    name: ' 16，能够听到旁人听不到的声音',
    type: 9,
    id: 16,
  },
  {
    name: ' 17，发抖',
    type: 5,
    id: 17,
  },
  {
    name: ' 18，感到大多数人都不可信任',
    type: 8,
    id: 18,
  },
  {
    name: ' 19，胃口不好',
    type: 10,
    id: 19,
  },
  {
    name: ' 20，容易哭泣',
    type: 4,
    id: 20,
  },
  {
    name: ' 21，同异性相处时感到害羞或者不自在',
    type: 3,
    id: 21,
  },
  {
    name: ' 22，感到受骗，中了圈套或者别人想抓住自己',
    type: 4,
    id: 22,
  },
  {
    name: ' 23，无缘无故的感到害怕',
    type: 5,
    id: 23,
  },
  {
    name: ' 24，自己不能控制的大发脾气',
    type: 6,
    id: 24,
  },
  {
    name: ' 25，怕单独出门',
    type: 7,
    id: 25,
  },
  {
    name: ' 26，经常则怪自己',
    type: 4,
    id: 26,
  },
  {
    name: ' 27，感到腰痛',
    type: 1,
    id: 27,
  },
  {
    name: ' 28，感到难以完成的任务',
    type: 2,
    id: 28,
  },
  {
    name: ' 29，感到孤独',
    type: 4,
    id: 29,
  },
  {
    name: ' 30，感到苦闷',
    type: 4,
    id: 30,
  },
  {
    name: ' 31，过分担忧',
    type: 4,
    id: 31,
  },
  {
    name: ' 32，对事物不感兴趣',
    type: 4,
    id: 32,
  },
  {
    name: ' 33，感到害怕',
    type: 5,
    id: 33,
  },
  {
    name: ' 34，感到自己感情容易受到伤害',
    type: 3,
    id: 34,
  },
  {
    name: ' 35，感到旁人能知道自己的想法',
    type: 9,
    id: 35,
  },
  {
    name: ' 36，感到别人不理解自己',
    type: 3,
    id: 36,
  },
  {
    name: ' 37，感到人们对自己不友好，不喜欢自己',
    type: 3,
    id: 37,
  },
  {
    name: ' 38，做事的必须做的很慢以保证做得正确',
    type: 2,
    id: 38,
  },
  {
    name: ' 39，心跳的很厉害',
    type: 5,
    id: 39,
  },
  {
    name: ' 40，感到恶心或者胃部不舒服',
    type: 1,
    id: 40,
  },
  {
    name: ' 41，感到比不上别人',
    type: 3,
    id: 41,
  },
  {
    name: ' 42，肌肉酸痛',
    type: 1,
    id: 42,
  },
  {
    name: ' 43，感到有人在监视和谈论自己',
    type: 8,
    id: 43,
  },
  {
    name: ' 44，难以入睡',
    type: 10,
    id: 44,
  },
  {
    name: ' 45，做事必须反复检查',
    type: 2,
    id: 45,
  },
  {
    name: ' 46，难以作出决定',
    type: 2,
    id: 46,
  },
  {
    name: ' 47，怕乘电车，公共汽车，地铁或者货车',
    type: 7,
    id: 47,
  },
  {
    name: ' 48，呼吸有苦难',
    type: 1,
    id: 48,
  },
  {
    name: ' 49，一阵阵发冷或者发热',
    type: 1,
    id: 49,
  },
  {
    name: ' 50，因为感到害怕或者某些东西，场合或活动',
    type: 7,
    id: 50,
  },
  {
    name: ' 51，脑子变空了',
    type: 2,
    id: 51,
  },
  {
    name: ' 52，身体发麻或刺痛',
    type: 1,
    id: 52,
  },
  {
    name: ' 53，喉咙有梗塞感',
    type: 1,
    id: 53,
  },
  {
    name: ' 54，感到前途没希望',
    type: 4,
    id: 54,
  },
  {
    name: ' 55，不能集中注意力',
    type: 2,
    id: 55,
  },
  {
    name: ' 56，感到身体某个部分软弱无力',
    type: 1,
    id: 56,
  },
  {
    name: ' 57，感到紧张或者容易紧张',
    type: 5,
    id: 57,
  },
  {
    name: ' 58，感到手或者脚发重',
    type: 1,
    id: 58,
  },
  {
    name: ' 59，会想到死亡',
    type: 10,
    id: 59,
  },
  {
    name: ' 60，吃的太多',
    type: 10,
    id: 60,
  },
  {
    name: ' 61，当被人看着自己或谈论自己时感到不自在',
    type: 3,
    id: 61,
  },
  {
    name: ' 62，有一些不属于自己的想法',
    type: 9,
    id: 62,
  },
  {
    name: ' 63，有想打人或者伤害他人的冲动',
    type: 6,
    id: 63,
  },
  {
    name: ' 64，醒的太早',
    type: 10,
    id: 64,
  },
  {
    name: ' 65，必须反复洗手，点数目或触摸某些东西',
    type: 2,
    id: 65,
  },
  {
    name: ' 66，睡的不稳不深',
    type: 10,
    id: 66,
  },
  {
    name: ' 67，有想摔东西或破坏东西的冲动',
    type: 6,
    id: 67,
  },
  {
    name: '68，有一些别人没有的想法或念头',
    type: 8,
    id: 68,
  },
  {
    name: '69，感到对别人神经过敏',
    type: 3,
    id: 69,
  },
  {
    name: ' 70，在商店或电影院等人多的对方，感动不自在',
    type: 7,
    id: 70,
  },
  {
    name: ' 71，感到做任何事情都很困难',
    type: 4,
    id: 71,
  },
  {
    name: ' 72，感到一阵阵恐惧或惊恐',
    type: 5,
    id: 72,
  },
  {
    name: ' 73，感到在公共场合吃东西很不舒服',
    type: 3,
    id: 73,
  },
  {
    name: ' 74，经常与人争论',
    type: 6,
    id: 74,
  },
  {
    name: ' 75，单独一人时神经很紧张',
    type: 7,
    id: 75,
  },
  {
    name: ' 76，感到别人对自己的成绩没有做出恰当的评价',
    type: 8,
    id: 76,
  },
  {
    name: ' 77，即使和别人在一起也感到孤单',
    type: 9,
    id: 77,
  },
  {
    name: ' 78，感到坐立不安，心神不宁',
    type: 5,
    id: 78,
  },
  {
    name: ' 79，感到自己没有什么价值',
    type: 4,
    id: 79,
  },
  {
    name: ' 80，感到熟悉的东西变的陌生，或不是真的',
    type: 5,
    id: 80,
  },
  {
    name: ' 81，想大叫或摔东西',
    type: 6,
    id: 81,
  },
  {
    name: ' 82，害怕会在公共场合昏倒',
    type: 7,
    id: 82,
  },
  {
    name: ' 83，感到别人想占自己的便宜',
    type: 8,
    id: 83,
  },
  {
    name: ' 84，为一些有关“性”的想法而苦恼',
    type: 9,
    id: 84,
  },
  {
    name: ' 85，认为应该因为自己的过错而受到惩罚',
    type: 9,
    id: 85,
  },
  {
    name: ' 86，感到要快把事情做完',
    type: 5,
    id: 86,
  },
  {
    name: ' 87，感到自己的身体有严重问题',
    type: 9,
    id: 87,
  },
  {
    name: ' 88，从未感到和其他人亲近',
    type: 9,
    id: 88,
  },
  {
    name: ' 89，感到自己有罪',
    type: 10,
    id: 89,
  },
  {
    name: ' 90，感到自己脑子有毛病',
    type: 9,
    id: 90,
  },
];

export const S = [
  {
    id: 1,
    title: '没有',
  },
  {
    id: 2,
    title: '很轻',
  },
  {
    id: 3,
    title: '中等',
  },
  {
    id: 4,
    title: '偏重',
  },
  {
    id: 5,
    title: '严重',
  },
];

export const TYPE_NAME = {
  1: '躯体化',
  2: '强迫症状',
  3: '人际关系敏感',
  4: '抑郁',
  5: '焦虑',
  6: '敌对',
  7: '恐怖',
  8: '偏执',
  9: '精神病性',
  10: '其他',
  100: '总分',
};
